export const Data = {
	poem: [{
			title: '《咏柳》',
			author: '贺知章',
			poemWord: '碧玉妆成一树高，万条垂下绿丝绦。不知细叶谁裁出，二月春风似剪刀。',
		},
		{
			title: '《黄鹤楼送孟浩然之广陵》',
			author: '李白',
			poemWord: `故人西辞黄鹤楼，
	烟花三月下扬州。
	孤帆远影碧空尽，
	唯见长江天际流。`,
		},
		{
			title: '《送元二使安西》',
			author: '王维',
			poemWord: `渭城朝雨浥轻尘，
	客舍青青柳色新。
	劝君更尽一杯酒，
	西出阳关无故人。`,
		},
		{
			title: '《春望》',
			author: '杜甫',
			poemWord: `	国破山河在，
	城春草木深。
	感时花溅泪，
	恨别鸟惊心。
	烽火连三月，
	家书抵万金。
	白头搔更短，
	浑欲不胜簪。`,
		},
		{
			title: '《望庐山瀑布》',
			author: '李白',
			poemWord: `日照香炉生紫烟，
		遥看瀑布挂前川。
		飞流直下三千尺，
		疑是银河落九天。`,
		},
	]
}