export const Data = {
	poem: [{
			title: '《咏柳》',
			author: '贺知章',
			poemWord: '碧玉妆成一树高，万条垂下绿丝绦。不知细叶谁裁出，二月春风似剪刀。',
		},
		{
			title: '《黄鹤楼送孟浩然之广陵》',
			author: '李白',
			poemWord: `故人西辞黄鹤楼，
	烟花三月下扬州。
	孤帆远影碧空尽，
	唯见长江天际流。`,
		},
		{
			title: '《送元二使安西》',
			author: '王维',
			poemWord: `渭城朝雨浥轻尘，
	客舍青青柳色新。
	劝君更尽一杯酒，
	西出阳关无故人。`,
		},
		{
			title: '《春望》',
			author: '杜甫',
			poemWord: `	国破山河在，
	城春草木深。
	感时花溅泪，
	恨别鸟惊心。
	烽火连三月，
	家书抵万金。
	白头搔更短，
	浑欲不胜簪。`,
		},
		{
			title: '《望庐山瀑布》',
			author: '李白',
			poemWord: `日照香炉生紫烟，
		遥看瀑布挂前川。
		飞流直下三千尺，
		疑是银河落九天。`,
		},
	]
}
// 踏马的，简单点
export let poemStr = [
	'`芙蓉楼送辛渐	唐·王昌龄	寒雨连江夜入吴，平明送客楚山孤。洛阳亲友如相问，一片冰心在玉壶。`',
	`悯农（其一）	唐·李绅	春种一粒粟，秋收万颗子。四海无闲田，农夫犹饿死。`,
	`静夜思	唐·李白	床前明月光，疑是地上霜。举头望明月，低头思故乡。`,
	`古风二首 / 悯农二首	唐·李绅	春种一粒粟，秋收万颗子。四海无闲田，农夫犹饿死。锄禾日当午，汗滴禾下土。谁知盘中餐，粒粒皆辛苦。`,
	`悯农	唐·李绅	锄禾日当午，汗滴禾下土。谁知盘中餐，粒粒皆辛苦。`,
	`春夜喜雨	唐·杜甫	好雨知时节，当春乃发生。随风潜入夜，润物细无声。野径云俱黑，江船火独明。晓看红湿处，花重锦官城。`,
	`绝句	唐·杜甫	两个黄鹂鸣翠柳，一行白鹭上青天。窗含西岭千秋雪，门泊东吴万里船。`,
	`九月九日忆山东兄弟	唐·王维	独在异乡为异客，每逢佳节倍思亲。遥知兄弟登高处，遍插茱萸少一人。`,
	`江雪	唐·柳宗元	千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。`,
	`夜雨寄北	唐·李商隐	君问归期未有期，巴山夜雨涨秋池。何当共剪西窗烛，却话巴山夜雨时。`,
	`早发白帝城	唐·李白	朝辞白帝彩云间，千里江陵一日还。两岸猿声啼不住，轻舟已过万重山。`,
	`枫桥夜泊	唐·张继	月落乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。`,
	`白雪歌送武判官归京	唐·岑参	北风卷地白草折，胡天八月即飞雪。忽如一夜春风来，千树万树梨花开。散入珠帘湿罗幕，狐裘不暖锦衾薄。将军角弓不得控，都护铁衣冷难着。瀚海阑干百丈冰，愁云惨淡万里凝。中军置酒饮归客，胡琴琵琶与羌笛。纷纷暮雪下辕门，风掣红旗冻不翻。轮台东门送君去，去时雪满天山路。山回路转不见君，雪上空留马行处。`,
	`寻隐者不遇	唐·贾岛	松下问童子，言师采药去。只在此山中，云深不知处。`,
	`相思	唐·王维	红豆生南国，春来发几枝。愿君多采撷，此物最相思。`,
	`过故人庄	唐·孟浩然	故人具鸡黍，邀我至田家。绿树村边合，青山郭外斜。开轩面场圃，把酒话桑麻。待到重阳日，还来就菊花。`,
	`鸟鸣涧	唐·王维	人闲桂花落，夜静春山空。月出惊山鸟，时鸣春涧中。`,
	`草 / 赋得古原草送别	唐·白居易	离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。`,
]

export function setPoemObj(str) {
	console.log('strsetPoemObj');
	let poemArr = str.split(/\s/g)
	let title = `《${poemArr[0]}》`
	let author = poemArr[1]
	let poemWord = poemArr[2]
	return {
		title,
		author,
		poemWord
	}
}
// let poemArr = poemStr.map(item => setPoemObj(item))